// config.js
import moment from 'moment-timezone';

export const ownerNumber = ['79969902483'];
export const ownerName = 'Русская ворона';
export const botName = 'Юмэко Бот';
export const region = 'Rusia';
export const timezone = 'Europa/Rusia/Moscu';
export const prefix = '.';
export const mode = 'Public';

export const getTime = () => moment().tz(timezone).format('HH:mm:ss');
export const getDate = () => moment().tz(timezone).format('dddd, DD MMMM YYYY');

// Estilos Menu O Decoración 
/*
*╭ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂╼*
│
│⎆
│
│⎆
│
*╰┅┄̵̇┈̶̣┄̵̇┈̶̣┄̵̇┄̶̣┈̵̇┄̶̣┄̵̇┈̶̣┄̵̇┈̶̣┄̵̇┈̶̣┅╼*

╭╶╌╌╌╌╌┈┈┈┈╌╌╌╌╌╶╮
┊
╰╶╌╌╌╌╌┈┈┈┈╌╌╌╌╌╶╯

╭╴─━━━━━━━━━━━━─╶╮
┃ 
╰╴─━━━━━━━━━━━━─╶╯

╔◡╍┅•.⊹︵ࣾ᷼ ׁ𖥓┅╲۪ ⦙᷼᷼͝͝⦙ ׅ╱ׅ╍𖥓 ︵ࣾ᷼︵ׄׄ᷼⊹┅╍◡╗
┋  ⣿̶⃚̶̸ֻ〪ׅ⃕݊⃧͝ᤢ֠◌ִ̲ LO QUE SEA  ꨪ̸⃙ׅᮬֺ๋֢᳟  ┋
╚◠┅┅˙•⊹.⁀𖥓 ׅ╍╲۪ ⦙᷼᷼͝͝⦙ ׅ╱ׅ╍𖥓 ◠˙⁀۪ׄ⊹˙╍┅◠╝

꥓໋╭࣭۬═ֽ̥࣪━᜔๋݈═𑂺ׄ︵ິּ֙᷼⌒݈᳹᪾̯ ⋮꥓ּ〪࣭ׄິ᜔ּ໋࣭ׄ⋮⌒ໍּ֣ׄ═ᮣໍ࣭ׄ━𑂺᜔꥓໋┉꥓ׂ᷼━᜔࣭֙━๋݈═̥࣭۬╮
> ᠙᳞✿̶᮫᮫ְְׅ᳝ׅ᳝᳞᳞࣪᪲࣪֘⣷ׅ᳝࣪ ࣪࣪𖡻ְְׅ᳝ׅׅ࣪࣪֘ᰰ🌵᮫ְׅ᳝࣪᪲⃞̶𝝸𝕝᮫ְ᳝᳝⃨۪۪۪ׅ᳝࣪࣪っְְׅ᳝۪⃨۪۪۪࣪:
> ᠙᳞✿̶᮫᮫ְְׅ᳝ׅ᳝᳞᳞࣪᪲࣪֘⣷ׅ᳝࣪ ࣪࣪𖡻ְְׅ᳝ׅׅ࣪࣪֘ᰰ᮫ְׅ᳝࣪᪲⃞̶𝝸𝕝᮫ְ᳝᳝⃨۪۪۪ׅ᳝࣪࣪っְְׅ᳝۪⃨۪۪۪࣪:
꥓໋╰ׅ۬═ֽ̥࣪━᜔๋݈═𑂺ׄ︵ິּ֙᷼⌒݈᳹᪾̯ ⋮꥓ּ࣭ׄ⋮⌒ໍּ֣ׄ═ᮣໍ࣭ׄ━𑂺᜔꥓໋┉꥓ׂ᷼━᜔࣭֙━๋݈═̥࣭۬╯

*╭ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂ ̵݁ ̵݂╼*
│ *╔◡╍┅•.⊹︵ࣾ᷼ ׁ𖥓┅╲۪ ⦙᷼᷼͝͝⦙ ׅ╱ׅ╍𖥓 ︵ࣾ᷼︵ׄׄ᷼⊹┅╍◡╗*
│ *┋  ⣿̶⃚̶̸ֻ〪ׅ⃕݊⃧͝ᤢ֠◌ִ̲ ⭉Eͭͮͣͨ҉nͦ͌lͫ͢a̤̫͢͠c̤̫ͭ҉͢e̤̫s͌֎⛦/ ҉҈H҈ͬe҈nͣ҈ͭ͌͢t̫͢a̤̫͋i͌֎⛦/ͧͫ͢͠Sͦͭ͌tͬ҉͋iͭcͦͫͨͣ͢k҈ͤ͠e҉ͤͨ͢rͦ͌ͬ͋s͠҉҈ͣ⥲  ꨪ̸⃙ׅᮬֺ๋֢᳟  ┋*
│ *╚◠┅┅˙•⊹.⁀𖥓 ׅ╍╲۪ ⦙᷼᷼͝͝⦙ ׅ╱ׅ╍𖥓 ◠˙⁀۪ׄ⊹˙╍┅◠╝*
│
│⎆ ʜᴏʟᴀ, ʟᴏꜱ ɪɴᴠɪᴛᴀᴍᴏꜱ ᴀ ɴᴜᴇꜱᴛʀᴏ ɢʀᴜᴘᴏ ᴅᴇ: 
│⎆ ᴇɴʟᴀᴄᴇꜱ (ꜱᴏʟᴏ ꜱᴀɴᴏꜱ) 
│⎆ ʜᴇɴᴛᴀɪ ᴏ +18 
│⎆ ꜱᴛɪᴄᴋᴇʀꜱ (ꜱᴀɴᴏꜱ, ʜᴇɴᴛᴀʏ ᴏ +18) 
│
│᠙᳞✿᮫ְׅ᳝࣪᪲ ᴀɴᴛᴇ ᴛᴏᴅᴏ ʀᴇꜱᴘᴇᴛᴀᴍᴏꜱ ɢᴜꜱᴛᴏꜱ 
│᠙᳞✿᮫ְׅ᳝࣪᪲ ʏ ᴍᴀɴᴇᴊᴀᴍᴏꜱ ᴄᴏɴᴛᴇɴɪᴅᴏ ɴᴏꜱᴏᴛʀᴏꜱ 
│᠙᳞✿᮫ְׅ᳝࣪᪲ ʟᴏꜱ ᴀᴅᴍɪɴɪꜱᴛʀᴀᴅᴏʀᴇꜱ ꜱɪ ɢᴜꜱᴛᴀꜱ 
│᠙᳞✿᮫ְׅ᳝࣪᪲ ᴅᴀʀ ᴛᴜ ᴀᴘᴏʀᴛᴇ ꜱᴇʀɪᴀ ᴅᴇ ᴀɢʀᴀᴅᴇᴄɪᴍɪᴇɴᴛᴏ
│
│̶᮫ְ᳞᳞֘⣷ׅ᳝࣪ ࣪࣪𖡻ְְׅ᳝ׅׅ࣪࣪֘ᰰ᮫ְׅ᳝࣪᪲⃞̶𝝸𝕝᮫ְ᳝᳝⃨۪۪۪ׅ᳝࣪࣪っְְׅ᳝۪⃨۪۪۪࣪: ɴᴜᴇꜱᴛʀᴏ ᴇɴʟᴀᴄᴇ
│̶᮫ְ᳞᳞֘⣷ׅ᳝࣪ ࣪࣪𖡻ְְׅ᳝ׅׅ࣪࣪֘ᰰ᮫ְׅ᳝࣪᪲⃞̶𝝸𝕝᮫ְ᳝᳝⃨۪۪۪ׅ᳝࣪࣪っְְׅ᳝۪⃨۪۪۪࣪: https://chat.whatsapp.com/EhRTcJwjN76GRV9idvEfC5
*╰┅┄̵̇┈̶̣┄̵̇┈̶̣┄̵̇┄̶̣┈̵̇┄̶̣┄̵̇┈̶̣┄̵̇┈̶̣┄̵̇┈̶̣┅╼*

*/ 